### 1. pandas로 데이터 가져오기

In [1]:
import pandas as pd   # pandas 패키지 불러오기
import numpy as np    # numpy 패키지 불러오기

<br>

> pandas로 csv파일 불러오기 <br>

In [2]:
df = pd.read_csv('bank_customer.csv')

In [ ]:
df #  실행시 전체 dataSet 출력


> 불러온 csv파일 확인 <br>

In [15]:
df.info()
# df.index()  # indext에 대한 세부정보 (! 기본RangeIndex는 안됨)  
# df.columns  # columns 세부정보
# df.values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13563 entries, 0 to 13562
Data columns (total 9 columns):
cid          13563 non-null object
age          13563 non-null int64
job          13476 non-null object
marital      13563 non-null object
education    12995 non-null float64
default      13563 non-null object
balance      13563 non-null int64
housing      13563 non-null object
loan         13563 non-null object
dtypes: float64(1), int64(2), object(6)
memory usage: 953.7+ KB


> 9개의 column(index 제외) , column별 row, null값 여부, dataType 확인 <br>

In [9]:
df.head(10)  #  맨위에서 부터 10개 출력 
# df.tail(10)  # 맨아래에서 부터 10개 출력

      cid  age          job  marital  education default  balance housing loan
0  C00004   47  blue-collar  married        NaN      no     1506     yes   no
1  C00005   33          NaN   single        NaN      no        1      no   no
2  C00009   58      retired  married        1.0      no      121     yes   no
3  C00021   28  blue-collar  married        2.0      no      723     yes  yes
4  C00025   40      retired  married        1.0      no        0     yes  yes
5  C00026   44       admin.  married        2.0      no     -372     yes   no
6  C00027   39   management   single        3.0      no      255     yes   no
7  C00029   46   management   single        2.0      no     -246     yes   no
8  C00031   57   technician  married        2.0      no      839      no  yes
9  C00035   51   management  married        3.0      no    10635     yes   no

In [ ]:
df.T # 데이터 전치 ( Columns <-> index )

In [ ]:
df.sort_index(ascending=True) # ascending = False


> 데이터 오름차순,내림차순 정렬 (index 기준) <br>

In [ ]:
df.sort_values(by='age',ascending=False)


> 데이터 값 기준으로 정렬(특정 column 선택) <br><br>

### 2. Data Selection
<br><br>

In [ ]:
# df['age'] 
df[['age','cid']]  # 다중선택 => [[]]

# df.loc[[0,10]]

> column 선택하기
<br>

In [35]:
df[0:10] # 0~9 행 슬라이스  ## df.loc[0:10]

      cid  age          job  marital  education default  balance housing loan
0  C00004   47  blue-collar  married        NaN      no     1506     yes   no
1  C00005   33          NaN   single        NaN      no        1      no   no
2  C00009   58      retired  married        1.0      no      121     yes   no
3  C00021   28  blue-collar  married        2.0      no      723     yes  yes
4  C00025   40      retired  married        1.0      no        0     yes  yes
5  C00026   44       admin.  married        2.0      no     -372     yes   no
6  C00027   39   management   single        3.0      no      255     yes   no
7  C00029   46   management   single        2.0      no     -246     yes   no
8  C00031   57   technician  married        2.0      no      839      no  yes
9  C00035   51   management  married        3.0      no    10635     yes   no

> 슬라이스 <br>

In [ ]:
# df[20130101 : 20150202]

> range index뿐만 아니라 날짜 인덱스 등 다양한 형식 가능 <br>
> 만약 index가 2013-05-02 인 경우 pandas에서 자동으로 20130502로 인식
<br>

<br>

####  2.1 loc,iloc
<br>

> dataframe.loc[행,열] <br><br>
loc[] 에 값을 하나만 넣는 경우 row 선택 <br>
<br>
> iloc는 정수형으로(몇번째부터 몇번째)으로 접근가능하지만 loc는 index가 정수형이 아닌경우(특정값 ex) 20130102 )인 경우를 고려해주어야 한다

In [4]:
# df.loc[3]        # index의 "값"이 3인 row의 값들을 선택
# df.loc[0:3]      # index의 "값" 슬라이싱
df.loc[[0,3]]

      cid  age          job  marital  education default  balance housing loan
0  C00004   47  blue-collar  married        NaN      no     1506     yes   no
3  C00021   28  blue-collar  married        2.0      no      723     yes  yes

In [8]:
# df.age >300  # 블리언 타입 출력
df.loc[ df.age > 300 ]   # boolean 활용 loc 슬라이싱

         cid  age         job marital  education default  balance housing loan
7788  C25900  380  management  single        3.0      no     1998      no   no

> boolean값 활용 indexing <br>

In [12]:
def re_index(df):
    return df.age > 300  # age 300 이상 블리언 판별 함수

df.loc[re_index(df)]  #  loc의 행을 함수값으로 줌

         cid  age         job marital  education default  balance housing loan
7788  C25900  380  management  single        3.0      no     1998      no   no

> 함수 활용 <br>

In [18]:
# df.loc[:,['cid','age','job']]  #  loc [행 전체 , 컬럼 사용자지정]

df.loc[35:45,['age','cid']]  # loc [35~45 행, 컬럼 사용자 지정]

    age     cid
35   59  C00109
36   45  C00110
37   29  C00111
38   46  C00112
39   36  C00114
40   57  C00120
41   29  C00127
42   31  C00129
43   38  C00133
44   43  C00138
45   46  C00140

<br>

In [23]:
df.iloc[0:10,1]   # iloc 사용

0    47
1    33
2    58
3    28
4    40
5    44
6    39
7    46
8    57
9    51
Name: age, dtype: int64

> iloc <br>
> iloc는 loc와 다르게 integer 타입으로만 범위 지정이 가능하다 <br>
> loc처럼 특정 값의 형식으로 index를 지정할 수 없고 오직 몇번째인지 integer형식으로만 지정 가능
> df.iloc[row index range , column range]
<br><br>

### 3. Data Setting
<br><br>

In [136]:
# 데이터 프레임에 새로운 col을 추가할 경우 index range에 맞게 값 지정해주는 방법

df_2 = df # 복사본 생성
# df_2['E'] = df['cid']  # df_2[E] 컬럼을 원본읜 cid컬럼 가져와서 생성 (* 행범위 맞추기 위해)
# 이런식으로 만들면 이미 만들어져 있는(범위에 맞게) 컬럼만 사용가능


df_2.loc[:,'E'] = np.array([5] * len(df_2))  # df_2의 E컬럼선택후 np.array로 df_2의 len만큼 5 지정
df_2.loc[0:10,['E']]  ## 확인

    E
0   5
1   5
2   5
3   5
4   5
5   5
6   5
7   5
8   5
9   5
10  5

In [ ]:
#  df2 = df.copy()
#  df2[df2 > 0] = -df2  
#  df2

<br><br>
###  4. Missing Data(결측치)
<br>

> 결측값 확인하기
<br>

In [138]:
# df.isnull() # 실행시 전체 dataset 결측값 여부 true / false 형식으로 반환    # notnull 은 반대로 반환

In [ ]:
df.isnull().sum()  # 컬럼별 결측값 개수 확인 

# 결측치 갯수 파악하고자 할 경우 count 사용하면 안됨 , count는 결측값 상관안하고 행의 갯수를 반환함

# df.notnull().sum()  # 컬럼별 결측값을 제외한 값의 개수 확인

In [30]:
df['education'].isnull().sum()   # 특정컬럼 결측값 개수 확인

568

In [ ]:
df.isnull().sum(1)  # row 별 결측값 개수 확인

# df.notnull().sum(1)  # row 별 결측값 제외 개수 확인

<br>
> 결측값 처리하기

In [36]:
df.isnull().sum()

cid            0
age            0
job           87
marital        0
education    568
default        0
balance        0
housing        0
loan           0
dtype: int64

In [4]:
# df_3 = df  #  복사본 생성
# df_3.fillna(value=5)  # 모든 결측값을 5로 대체
# df_3.filna(value="string")  # 모든 결측값을 missing라는 str값으로 대체 

# df_4 = df
# df_4.dropna(how='any')  # 결측값을 가지고 있는 모든 행 제거

# df_5 = df
# df_5.isna()   # 데이터프레임의 모든 값을 boolean 형태로 표시하고 결측값만 True값으로

> 결측값 연산시 <br>

1. sum, comsum 연산시 => 0으로 처리 <br> 
2. mean, std 연산시 => 분석대상에서 제외 <br>
3. column간 연산시 하나라도 결측값이면 결측값으로 반환됨 ( ex) 컬럼1 + 컬럼2 = 컬럼3 으로 표현하는 경우) <br>
4. dataframe간 연산시 동일한 컬럼끼리는 non을 0으로 처리, 한쪽에만 존재하는 컬럼과의 연산은 non 반환
<br><br>

#### apply로 함수 적용

<br>

> 인자를 여러개 받을 경우 => apply 사용

In [9]:
df_5['age'].iloc[:10].apply(np.cumsum)   # np.cumsum함수를 apply 사용하여 적용

0    [47]
1    [33]
2    [58]
3    [28]
4    [40]
5    [44]
6    [39]
7    [46]
8    [57]
9    [51]
Name: age, dtype: object

In [73]:
df_t = pd.DataFrame({'A' : [1,2,3,4],
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32') })

df_t # testDF 생성

   A    C
0  1  1.0
1  2  1.0
2  3  1.0
3  4  1.0

In [ ]:
df_t[['A','C']].apply(lambda x: x.max()-x.min(), axis = 0 )  # axis=0 =>  column 기준 함수연산
df_t[['A','C']].apply(lambda x: x.max()-x.min(), axis = 1 )  # axis=1 => row별 함수연산

<br>

##### lambda  

<br>

>'익명함수'를 뜻하며, 변수에 할당하지 않고 사용한다 <br>
> 함수를 간단하게 사용할 수 있음

<br>

* lambda 인자 : 표현식

In [13]:
#  hap 함수정의 
def hap(x, y):
    return x + y

In [5]:
# hap함수를 lambda로
(lambda x,y: x + y)(10, 20)

30

In [1]:
# 인자를 넣지 않은 경우 
# lambda : 0  => 모든 인자를 0으로 바꾼다

<br>

#### map
<br>
> map(함수,리스트) <br>
> map은 함수와 리스트를 인자로 받은후, 리스트로부터 하나씩 값을 꺼내 함수를 적용시킨 후 새로운 리스트에 결과값을 담는다

In [8]:
# 1. lambda 함수 생성
lambda x : x**2

# 2. map 함수 생성 => map(함수,리스트)  ## range(5) => [0,1,2,3,4] 리스트 반환
map(lambda x:x**2,range(5))

# 3. map함수의 결과를 새로운 list에 담아냄
list(map(lambda x : x**2,range(5)))

[0, 1, 4, 9, 16]

<br>

#### reduce
<br>
> reduce는 *순서형자료(리스트,튜플,문자열)의 원소들을 누적적으로 함수에 적용시켜 줌 <br>
> reduce(함수,순서형자료)

In [35]:
# from functools import reduce  # reduce import

reduce(lambda x,y : x+y , range(5))
# reduce(lambda x,y : x+y , [0,1,2,3,4])
# reduce(lambda x,y : x+y , "안녕하세요")
# reduce(lambda x,y : x+y , (3,4,5))

10

<br>

#### filter
<br>

> filter(함수,리스트) <br>
> 리스트에서 함수의 조건에 참인값들을 걸러 새로운 리스트에 담아냄 <br>

In [45]:
list(filter(lambda x : x>5 ,range(10)))

[6, 7, 8, 9]

In [53]:
list(filter(lambda x : x, [-1,-2,0,1,2,3,4]))  # 0은 F값이므로 걸러짐 즉, 0이 되는것을 함수에 의해 0(Flase)가 되는것을 filterling

[-1, -2, 1, 2, 3, 4]

<br><br>
###  5. GROUPING
<br><br>

<br>

> 몇몇 기준에 따라 여러 그룹으로 데이터를 분할 (splitting) <br>
> 각 그룹에 독립적으로 함수를 적용 (applying) <br>
> 결과물들을 하나의 데이터 구조로 결합 (combining) <br>
<br> 

> 통계량을 계산할 열.groupby(기준 열)
> 지정한 "그룹"별로 통계량 측정 위해 사용

In [99]:
## job 기준 groupby
df_grouped_job = df.groupby(df['job']).max()
df_grouped_job

                  cid  age marital  education default  balance housing loan
job
admin.         C45174   69  single        3.0     yes    18188     yes  yes
blue-collar    C45182   70  single        3.0     yes    66653     yes  yes
entrepreneur   C45176  270  single        3.0     yes    42045     yes  yes
housemaid      C45030   82  single        3.0     yes    23663     yes  yes
management     C45198  380  single        3.0     yes    98417     yes  yes
retired        C45205   92  single        3.0     yes    81204     yes  yes
self-employed  C45098   71  single        3.0     yes    34247     yes  yes
services       C45186   69  single        3.0     yes    57435     yes  yes
student        C45204   47  single        3.0     yes    24025     yes  yes
technician     C45183   71  single        3.0     yes    29207     yes  yes
unemployed     C45167   65  single        3.0     yes    19690     yes  yes

In [100]:
##  job컬럼 기준 balance 평균
df_grouped_job_balance = df['balance'].groupby(df['job']).mean()
df_grouped_job_balance

job
admin.            939.976760
blue-collar      1071.583807
entrepreneur     1363.362981
housemaid        1330.928753
management       1773.943856
retired          2087.175595
self-employed    1752.765864
services         1013.221951
student          1551.338762
technician       1238.845514
unemployed       1536.778920
Name: balance, dtype: float64

In [107]:
## job,marital(2개 컬럼) 기준 balance 평균 
df_grouped_job_marital = df['balance'].groupby([df['job'],df['marital']]).mean()
df_grouped_job_marital

job            marital
admin.         divorced     758.852814
               married     1019.399464
               single       907.066163
blue-collar    divorced     640.765766
               married     1129.329787
               single      1023.310744
entrepreneur   divorced    1036.860000
               married     1500.523810
               single      1030.027778
housemaid      divorced    1478.473684
               married     1138.844828
               single      2359.065217
management     divorced    1577.430818
               married     1870.109547
               single      1666.394318
retired        divorced    1896.000000
               married     2153.207101
               single      1821.615385
self-employed  divorced    1706.800000
               married     1846.223404
               single      1571.162963
services       divorced     920.386076
               married     1176.556172
               single       719.501425
student        divorced    1092.333333
               married     1062.066667
               single      1581.498270
technician     divorced     880.161172
               married     1330.523539
               single      1219.580769
unemployed     divorced    1293.696970
               married     1567.086364
               single      1546.735294
Name: balance, dtype: float64

In [ ]:
# 그룹화 - '선별' 단위로 각각의 노선에 대한 총 갯수
tmp1 = df.groupby(df['선별'])['선별'].count() # 선별 갯수만 보고싶은경우
tmp1

In [3]:
#  transfomr 메서드
#  groupby의 transform 메서드를 사용해 그룹에 대한 대표값을 만드는것이 아닌 그룹별 계산을 통해 데이터 자체를 변형한다

# 예제
#  df = pd.DataFrame({'group_1': ['a', 'a', 'a', 'a', 'a',  

#                                   'b', 'b', 'b', 'b', 'b',], 

#                        'group_2': ['c', 'c', 'c', 'd', 'd', 

#                                      'e', 'e', 'e', 'f', 'f'], 

#                        'col': [1, 2, np.NaN, 4, np.NaN, 

#                               6, 7, np.NaN, 9, 10]})

# df['nn'] = df.groupby(['group_1','group_2'])['col'].transform('max') 
# grouped된 그룹에서 가장 큰 값으로 새로 만들 컬럼('nn')의 값을 채움

<br><br>
### 6. Categorical Data
<br><br>

In [128]:
# 범주형 data로 변환하기
df_category = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df_category

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [129]:
# df_category.info()  # dataset 확인

# 카테고리형으로 변환
df_category['grade'] = df_category['raw_grade'].astype('category')

In [130]:
## 카테고리 이름 변경
# Series.cat.categories
df_category['grade'].cat.categories = ["very good", "good", "very bad"]

df_category

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

<br><br>
### 7. 컬럼 항목별 갯수 
<br><br>

In [132]:
df_category.groupby(df_category['grade']).size()

# diamonds['cut'].value_counts()

grade
very good    3
good         2
very bad     1
dtype: int64

<br><br>
### 8. 자료형 변환
<br><br>

In [ ]:
# Object to float
# pd.to_numeric(df_1['avg'], errors='coerce')

<br><br>
### 9. 조건에 따라 값 변경하기 => np.where
<br><br>

In [ ]:
# a = numpy.where( 조건문, true일 경우 변경 값, false일 경우 변경 값 )

<br><br>
### 10. 컬럼별 데이터 조건 추출 
<br><br>

In [ ]:
# print(df[df['E'].isin(['two', 'four'])]) # 'E'열에서 'two', 'four'을 가지고 있는 행 출력

<br><br>
### 11. len VS count
<br><br>

In [2]:
# len의 경우 컬럼의 행 갯수 (nan값 포함)
# len(df.type_of_business)


# count의 경우 nan값을 제외한 행 갯수를 알려줌
# df['type_of_business'].count()

<br><br>
### colum명이 첫번째 데이터로 들어가있는 경우
<br><br>

In [2]:
# df = pd.read_csv('./data/pima-indians-diabetes.csv', names=['pregnant','plasma','pressure','thickness',
#                                                                'insulin','BMI','pedigree','age','diabetes'])

# 이런식으로 데이터 불러옴과 동시에 column 이름 지정해주어서 해결가능

<br><br>
### agg 사용 컬럼별 함수적용
<br><br>

In [ ]:
"""
    groupby().agg()

    DataFrame의 groupby()는 SQL의 group by 보다 유연성이 떨어질 수 밖에 없다
    그래도 DataFrame의 groupby()에서 여러 개의 컬럼에 각각 다른 집계 함수를 사용할 때 agg() 함수 이용
"""

#  선실등급별 가장 많은 나이값, 평균요금 구하고자 한다면??
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'} # Age 컬럼에 max함수 , SibSp 컬럼에 sum함수 Fare 컬럼에 mean 함수적용하요 groupby

titanic.groupby('Pclass').agg(agg_format)

<br><br>
### agg 사용 시각화
<br><br>

In [ ]:
# 차종별, 노선별별 그룹화 작업
# tmp2 = df.groupby([df['차종'],df['선별']])['총이용인원'].count() 
# tmp2
# tmp2.plot(kind='bar',figsize=(12, 5),title="노선,차종별 총 이용인원")

## 위의 경우 이상하게 나옴

agg_format = {'총이용인원':"sum", "이용율" : "mean"} # 컬럼별 함수를 다르게 지정하여 # 컬럼별 비율이 다른 경우가 많음(%,수 등등)

tmp2 = df.groupby(df['선별'])[['총이용인원','이용율']].agg(agg_format) # 적용
tmp2
tmp2.plot(kind='bar',figsize=(12, 5),title="노선별 정보",y=["총이용인원","이용율"],subplots=True) # subplots=True => y에 따른 그래프 각 각 생성

<br><br>
### 불필요한 행 제거하고 불러오기
<br><br>

In [ ]:
# nmaes 지정해서 불러오는 경우 기존에 있던 컬럼명이 row로 들어가버리는 경우 발생
# 불필요한 행 제외하고 로딩하기
# df1 = pd.read_csv("result/temp.csv", names=['번호','시도','구군','인구수','넓이'],skiprows=[0],index_col='번호') # skiprows[0] 사용하여 해결

<br><br>
### Json파일 불러오기
<br><br>

In [ ]:
# JSON 파일 읽어오기
import json

df4 = json.load(open('data/JsonData.json'))
df4

<br><br>
### 데이타가 많은 경우 NaN 확인하는 방법 - missngno
<br>

https://github.com/ResidentMario/missingno

라이브러리 설치 (Anaconda Prompt 관리자 권한으로 실행)
 - > conda install missingno (안됨)
 - > pip install missingno (됨)

Jupyter에서 바로 실행
 - > !pip install missingno

<br><br>
### 컬럼 DateTime형식으로 변경하기
<br><br>

In [ ]:
# datetime 오브젝트로 변경하여 필요한 데이타 추출 및 계산 - 2

ebola['Date'] = pd.to_datetime(ebola['Date'])
ebola.head()

<br><br>
### [양적자료를 질적자료로 새로 생성 ]
<br><br>

In [1]:
# pd.cut 함수사용하여 양적자료를 범주형자료로 ( 조건을 지정 가능)

# bins에 의해서 구간 나눠서 라벨링
# diamonds['gprice'] = pd.cut(diamonds['price'],bins=[0,5000,10000,20000], labels=['5000','10000','15000','20000'])

<br><br>

### 최대 출력 수 늘리기

<br><br>

In [2]:
# import pandas as pd

# # 판다스 데이터프레임(DataFrame)을 출력할 때, 최대 출력할 수 있는 컬럼을 100개로 늘려줍니다.
# # 이렇게 해야 데이터를 분석할 때 출력해서 확인하기 편합니다.
# pd.options.display.max_columns = 100

<br><br>

### enumerate

<br><br>

In [1]:
# for idx,answer in enumerate(label):
#     p = pre[idx]
#     if p == answer: ok+=1
#     total +=1

# enumerate 사용 시 idx에 index를 반환하는 동시에 answer에 인자의 값(여기서는 label)을 순서대로 반환 
# 즉, 인자와 인자의 index를 동시에 사용가능